In [2]:
import numpy as np
import pandas as pd

In [3]:
data=np.random.randint(0,10,size=(4,3))
df=pd.DataFrame(data=data,index=["sila","aysegül","betül","efnan"],columns=["yas","calisma saati","gunluk uyku suresi"])
df

         yas  calisma saati  gunluk uyku suresi
sila       9              0                   1
aysegül    3              1                   2
betül      0              7                   0
efnan      0              3                   2

In [4]:
#bir column daha asagidaki yöntemi kullanarak ekleyebiliriz

df["bos vakit"]=24-df["gunluk uyku suresi"]-df["calisma saati"]
df

         yas  calisma saati  gunluk uyku suresi  bos vakit
sila       9              0                   1         23
aysegül    3              1                   2         21
betül      0              7                   0         17
efnan      0              3                   2         19

In [7]:
#silmeye de önce row silmeden baslayalim
#row silerken axis=0 , default olarak axis=0
#column silerken axis=1 
#df üzerindeki degisimi kayetmen için esitlemen lazım ya da inplace=True yaparsın

df.drop("efnan",axis=0)

         yas  calisma saati  gunluk uyku suresi  bos vakit
sila       9              0                   1         23
aysegül    3              1                   2         21
betül      0              7                   0         17

In [12]:
df.drop("yas",axis=1)

         yas  calisma saati  gunluk uyku suresi  bos vakit
aysegül    3              1                   2         21
betül      0              7                   0         17

In [11]:
df.drop("sila",axis=0, inplace=True)
df

         yas  calisma saati  gunluk uyku suresi  bos vakit
aysegül    3              1                   2         21
betül      0              7                   0         17

In [13]:
df["calisma saati"]

aysegül    1
betül      7
Name: calisma saati, dtype: int32

In [14]:
df[["yas","calisma saati"]]

         yas  calisma saati
aysegül    3              1
betül      0              7

In [15]:
df

         yas  calisma saati  gunluk uyku suresi  bos vakit
aysegül    3              1                   2         21
betül      0              7                   0         17

In [16]:
df["yas"]["betül"]

0

In [18]:
df.loc["aysegül"]

yas                    3
calisma saati          1
gunluk uyku suresi     2
bos vakit             21
Name: aysegül, dtype: int32

In [35]:
df.loc["betül"]["bos vakit"]
df

         yas  calisma saati  gunluk uyku suresi  bos vakit
aysegül  3.0            1.0                 2.0       21.0
betül    0.0            7.0                 0.0       17.0
sila     NaN            NaN                 NaN        NaN

In [41]:
#df ye yeni satir ekleme
#df.append(pd.DataFrame([[21,10,10,14]],columns=df.columns),ignore_index=True)

In [43]:
df<3

           yas  calisma saati  gunluk uyku suresi  bos vakit
aysegül  False           True                True      False
betül     True          False                True      False
sila     False          False               False      False

In [46]:
df[df>0]

         yas  calisma saati  gunluk uyku suresi  bos vakit
aysegül  3.0            1.0                 2.0       21.0
betül    NaN            7.0                 NaN       17.0

In [47]:
df

         yas  calisma saati  gunluk uyku suresi  bos vakit
aysegül  3.0            1.0                 2.0       21.0
betül    0.0            7.0                 0.0       17.0

In [48]:
df[df["yas"]>0]

         yas  calisma saati  gunluk uyku suresi  bos vakit
aysegül  3.0            1.0                 2.0       21.0

In [50]:
df[df["calisma saati"]<7]

         yas  calisma saati  gunluk uyku suresi  bos vakit
aysegül  3.0            1.0                 2.0       21.0

In [51]:
df

         yas  calisma saati  gunluk uyku suresi  bos vakit
aysegül  3.0            1.0                 2.0       21.0
betül    0.0            7.0                 0.0       17.0